
// 출처 목록
export const CP_SOURCES = [
  "장비-기본",
  "장비-강화",
  "장비-영혼각인",
  "장비-마석/영석",
  "장비-잠재력",
  "데바니온",
  "아르카나",
  "스티그마",
  "펫 이해도",
  "주신",
];

// 스탯 목록 (43개)
export const CP_STATS = [
  "공격력", "명중", "치명타", "생명력", "전투 속도",
  "방어력", "회피", "치명타 저항", "정신력", "이동 속도",

  "관통", "치명타 공격력", "후방 공격력", "피해 증폭", "무기 피해 증폭", "치명타 피해 증폭", "후방 피해 증폭",
  "봉혼석 추가 피해", "치명타 방어력", "후방 방어력", "피해 내성", "무기 피해 내성", "치명타 피해 내성", "후방 피해 내성",

  "다단 히트 적중", "후방 치명타", "막기 관통", "철벽 관통", "재생 관통", "완벽", "강타",
  "다단 히트 저항", "후방 치명타 저항", "막기", "철벽", "재생", "완벽 저항", "강타 저항",

  "PVE 공격력", "PVE 명중", "PVE 피해 증폭", "보스 공격력", "보스 피해 증폭",
  "PVE 방어력", "PVE 회피", "PVE 피해 내성", "보스 방어력", "보스 피해 내성",

  "치유 증폭", "재시전 시간",
  "받는 치유량",  
  "정신력 소모량",
  "정신력 획득 증가",

  "상태이상 저항",
  "상태이상 적중",

  "위력", "민첩", "정확", "의지", "지식", "체력",
];

// 아르카나 특수 규칙
export const ACTIVE_SPECIAL_RULES = {
  bonusLevels: [8, 12, 16, 20],
  bonusCP: {
    8: 0,
    12: 400,
    16: 800,
    20: 900,
  }
};

// 스티그마 특수 규칙
export const STIGMA_SPECIAL_RULES = {
  bonusLevels: [5, 10, 15, 20],
  bonusCP: [500, 1100, 1800, 2700],
  bonusCP: {
    5: 500,
    10: 1100,
    15: 1800,
    20: 2700,
  }
};

export const MAIN_STAT_EFFECTS = {
  "위력": { "공격력": { percentPerPoint: 0.1 } },
  "민첩": { "회피": { percentPerPoint: 0.1 }, "막기": { percentPerPoint: 0.1 }, "치명타 저항": { percentPerPoint: 0.1 } },
  "정확": { "명중": { percentPerPoint: 0.1 }, "치명타": { percentPerPoint: 0.1 } },
  "의지": { "상태이상 저항": { percentPerPoint: 0.1 } },
  "지식": { "상태이상 적중": { percentPerPoint: 0.1 } },
  "체력": { "생명력": { percentPerPoint: 0.1 } },
};

export const GOD_STAT_EFFECTS = {
  "파괴": { "공격력": { percentPerPoint: 0.2 }, "완벽 저항": { percentPerPoint: 0.2 } },
  "죽음": { "치명타": { percentPerPoint: 0.2 }, "재생 관통": { percentPerPoint: 0.2 } },
  "지혜": { "정신력 소모량": { percentPerPoint: -0.2 }, "강타": { percentPerPoint: 0.2 } },
  "운명": { "정신력": { percentPerPoint: 0.2 }, "철벽": { percentPerPoint: 0.2 } },
  "공간": { "이동 속도": { percentPerPoint: 0.2 }, "막기": { percentPerPoint: 0.2 } },
  "시간": { "전투 속도": { percentPerPoint: 0.2 }, "강타 저항": { percentPerPoint: 0.2 } },
  "생명": { "생명력": { percentPerPoint: 0.2 }, "재생": { percentPerPoint: 0.2 } },
  "환상": { "재시전 시간": { percentPerPoint: -0.2 }, "철벽 관통": { percentPerPoint: 0.2 } },
  "자유": { "명중": { percentPerPoint: 0.2 }, "회피": { percentPerPoint: 0.2 } },
  "정의": { "방어력": { percentPerPoint: 0.2 }, "완벽": { percentPerPoint: 0.2 } },
};

export const CP_WEIGHTS = {
  default: 0,
  "강타": { default: 710 }, // 260318 [쵸투브], [투즈TV] 689
  "공격력": { default: 31 }, // 260318 [초튜브] // 260318 [투즈TV] 29.5(데바니온 32.8) // 260321 데바니온으로 5 올리니까 263 올라감 (12당 52.6)
  "관통": { default: 0 }, // 260318 기준, 버그로 10으로 보여서 0으로 처리
  "다단 히트 적중": { default: 206 }, // 260318 [쵸투브], [투즈TV] 194
  "막기": { default: 0.77 }, // 260318 [쵸투브], [투즈TV] 0.8
  "명중": { default: 4, "데바니온": 3.69 }, // 260318 [쵸투브] 4, [투즈TV] 데바니온 3.69
  "무기 피해 내성": { default: 374 }, // 260318 [쵸투브], [투즈TV] 204
  "무기 피해 증폭": { default: 472.8 }, // 260318 [쵸투브], [투즈TV] 463.2
  "방어력": { default: 1.25, "데바니온": 0.82 }, // 260318 [쵸투브] 1.25 // 260318 [투즈TV] 데바니온 0.82
  "보스 피해 내성": { default: 102 }, // 260318 [투즈TV]
  "보스 피해 증폭": { default: 241.6 }, // 260318 [투즈TV]
  "생명력": { default: 0.125 }, // 260318 [쵸튜브] // 260318 [투즈TV] 0.13
  "완벽": { default: 534 }, // 260318 [쵸투브], [투즈TV] 154
  "이동 속도": { default: 300 }, // 260318 [쵸투브]
  "재생 관통": { default: 15 }, // 260318 [투즈TV]
  "재시전 시간": { default: 300 }, // 260318 [쵸투브], [투즈TV]
  "전투 속도": { default: 783 }, // 260318 [쵸튜브] // 260318 [투즈TV] 762
  "정신력": { default: 0.5, "데바니온": 34 }, // 260318 [쵸투브] 0.5, [투즈TV] 데바니온 34
  "철벽": { default: 96 }, // 260318 [쵸투브], [투즈TV] 51
  "철벽 관통": { default: 15 }, // 260318 [투즈TV]
  "치명타": { default: 5 }, // 260318 [투즈TV], [쵸투브]
  "치명타 공격력": { default: 17 }, // 260318 [쵸투브], [투즈TV] 5.7
  "치명타 저항": { default: 0.5, "데바니온": 10 }, // 260318 [쵸투브] 0.5, [투즈TV] 데바니온 10
  "치명타 피해 증폭": { default: 236.25 }, // 260318 [쵸투브], [투즈TV] 229.6
  "피해 증폭": { default: 497 }, // 260318 [쵸투브], [투즈TV] 482
  "피해 내성": { default: 376 }, // 260318 [쵸투브]
  "PVE 공격력": { default: 24.4 }, // 260318 [투즈TV]
  "PVE 피해 증폭": { default: 505 }, // 260318 [쵸투브], [투즈TV] 494.4
  "PVE 피해 내성": { default: 375 }, // 260318 [쵸투브], [투즈TV] 204
  "PVE 회피": { default: 0.8 }, // 260318 [투즈TV]
  "회피": { default: 0.8 }, // 260318 [쵸투브]
  "후방 피해 증폭": { default: 236.25 }, // 260318 [쵸투브]
};

export const MAIN_STAT_WEIGHTS = {
  default: 0,
  "위력": 97.7,
  "민첩": 0,
  "정확": 13.192,
  "의지": 0,
  "지식": 0,
  "체력": 0,
};

export const GOD_STAT_WEIGHTS = {
  default: 0,
};